Dormitory_Laundry/app/controllers/gest_use_pages_controller.rb

SELECT  "uses".* FROM "uses" WHERE "uses"."facility" = ? LIMIT ?  [["facility", "1W01"], ["LIMIT", 1]]
---
  def gest_use_wash
	@washStatus= Use.all
  @wash1 = Use.find_by(facility: '1W01')

SELECT  "uses".* FROM "uses" WHERE "uses"."facility" = ? LIMIT ?  [["facility", "1W01"], ["LIMIT", 1]]
---
  def gest_use_dry
    @dry1 = Use.find_by(facility: '1D01')