Dormitory_Laundry/app/controllers/photos_controller.rb

INSERT INTO "photos" ("name", "file_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "kut"], ["file_id", "d0d9be43e6bf789c0f865f029892190a7fd1c9b5c8ac28c96a725d2d78ca"], ["created_at", "2018-01-16 08:07:13.858353"], ["updated_at", "2018-01-16 08:07:13.858353"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save