Dormitory_Laundry/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."password" = ? LIMIT ?  [["password", "0001"], ["LIMIT", 1]]
---
  def create
	user = User.find_by(user_id: params[:session][:user_id])
	if user && User.find_by(password: params[:session][:password])