Dormitory_Laundry/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "A011"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? AND "users"."password" = ? LIMIT ?  [["user_id", "kanri"], ["password", "0004"], ["LIMIT", 1]]
SELECT  "uses".* FROM "uses" WHERE "uses"."facility" = ? LIMIT ?  [["facility", "1W01"], ["LIMIT", 1]]
---
  def create
        user = User.find_by(user_id: params[:session][:user_id])
	# user_pass = User.find_by(user_id: user, password: params[:session][:password])
        user_pass = User.find_by(user_id: params[:session][:user_id], password: params[:session][:password])
	kanri_id = params[:session][:user_id]
	kanri_pass = params[:session][:password]
	if kanri_id == 'kanri' && kanri_pass == '0004'
	   render 'kanri'
	   #elsif user && user_pass
	elsif kanri_id == 'gaibu' && kanri_pass == '0005'

  @wash1 = Use.find_by(facility: '1W01')

SELECT  "uses".* FROM "uses" WHERE "uses"."facility" = ? LIMIT ?  [["facility", "1W01"], ["LIMIT", 1]]
---
	def gaibu
 @wash1 = Use.find_by(facility: '1W01')

SELECT  "uses".* FROM "uses" WHERE "uses"."facility" = ? LIMIT ?  [["facility", "1W01"], ["LIMIT", 1]]
---
	def gaibu2
  @wash1 = Use.find_by(facility: '1W01')

SELECT  "uses".* FROM "uses" WHERE "uses"."facility" = ? LIMIT ?  [["facility", "1D01"], ["LIMIT", 1]]
---
      def gaibu3
@dry1 = Use.find_by(facility: '1D01')

SELECT  "uses".* FROM "uses" WHERE "uses"."facility" = ? LIMIT ?  [["facility", "1D01"], ["LIMIT", 1]]
---
	def gaibu4
@dry1 = Use.find_by(facility: '1D01')